//문제 리스트
var problem_arr = [
  (number = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]),
  (questions = [
    "달팽이도 이빨이 있다.", // 1번
    "토끼의 눈은 모두 빨갛다.", // 2번
    "강아지에 발에서 땀이 난다", // 3번
    "고양이도 잠을 잘 때 꿈을 꾼다. ", // 4번
    "북극곰은 겨울에 겨울잠을 잔다.", // 5번
    "말도 잠을 잘 때는 사람처럼 코를 곤다.", // 6번
    "카피바라는 잠수를 잘한다.", //7번
    "알락꼬리 여우 원숭이는 단독 생활을 한다.", //8번
    "카피바라는 설치류 중 가장 큰 종이다.", //9번
    "라쿤은 깨끗해서 항상 먹이를 씻어 먹는다. ", //10번
  ]),
  (answer = [
    "O", // 1번답
    "X", // 2번답
    "O", // 3번답
    "O", // 4번답
    "X", // 5번답
    "O", // 6번답
    "O", // 7번답
    "X", // 8번답
    "O", // 9번답
    "X", // 10번답
  ]),
  (reson = [
    "달팽이는 혀에 치설이라는 이빨이 <br> 2만여개 있습니다!", // 1번 이유
    "털이 회색빛이거나 누런 토끼는 눈이 빨갛지 않습니다.", // 2번 이유
    "강아지 발바닥에는 샘 분비 땀샘이 있습니다. <br>이곳으로 땀 배출과 체온 조절을 하는겁니다.", //3번 이유
    "우리의 친구들도 잠을 잘 때 꿈을 꾼답니다~!", // 4번 이유
    "북극곰은 반대로 여름잠을 잔다고 해요", //5번 이유
    "말은 피곤하면 코를골고 잠꼬대도 한다고 합니다.", //6번 이유
    "수영으로는 시속 40km!!! <br>수중 스피드는 악어나 백상아리, 펭귄과 비슷해요!", //7번 이유
    "새끼를 낳아도 젖 먹일 때를 제외하고 누구의 새끼든 간에 서로 돌봐주기도 해요", //8번 이유
    "현존하는 설치류 중 가장 큰 동물 동물이에요!", //9번 이유
    "라쿤은 시력이 나빠 손으로 만져보면서 무엇인지 알아내기 위해서에요~! ", //10번 이유
  ]),
];
