//문제 리스트
var problem_arr = [
  (number = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]),
  (questions = [
    "달팽이도 이빨이 있다.", // 1번
    "토끼의 눈은 모두 빨갛다.", // 2번
    "강아지에 발에서 땀이 난다", // 3번
    "고양이도 잠을 잘 때 꿈을 꾼다. ", // 4번
    "북극곰은 겨울잠을 잔다.", // 5번
    "말도 잠을 잘 때는 사람처럼 코를 곤다.", // 6번
    "카피바라는 잠수를 잘한다.", //7번
    "알락꼬리 여우 원숭이는 단독 생활을 한다.", //8번
    "카피바라는 설치류 중 가장 큰 종이다.", //9번
    "라쿤은 땅속에 기어 다니는 지렁이 소리도 들을 수 있다. ", //10번
  ]),
  (answer = [
    "O", // 1번답
    "X", // 2번답
    "X", // 3번답
    "O", // 4번답
    "X", // 5번답
    "O", // 6번답
    "O", // 7번답
    "X", // 8번답
    "O", // 9번답
    "O", // 10번답
  ]),
];
